c_lang.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>c-lang</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="org489ec6b">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-org989562a" class="outline-2">
<h2 id="org989562a">C programming language</h2>
<div class="outline-text-2" id="text-org989562a">
<p>
Standards not correctness are all that matters when the world is a PDP-11
</p>
</div>
<div id="outline-container-org5831e04" class="outline-3">
<h3 id="org5831e04">notes</h3>
<div class="outline-text-3" id="text-org5831e04">
<ul class="org-ul">
<li>effect type only (no handlers) system proposed in C2y</li>
<li>shared<sub>libraries</sub> can be packaged as executables
<ul class="org-ul">
<li><code>/lib64/ld-linux-x86-64.so.2</code> does this as does <code>libQt5Core.so.5</code></li>
<li>Add <code>-shared</code>, <code>-fpie</code>, <code>-Wl,--entry,main</code>, <code>-L. -l:hello -Wl,-rpath,.</code>, flags to gcc
<ul class="org-ul">
<li>ensure there is an <code>exit()</code> call in the entrypoint main</li>
</ul></li>
<li>Add section for <code>PT_INTERP</code>
<ul class="org-ul">
<li><code>const char interp[] __attribute__ ((section(".interp"))) = PT_INTERP;</code></li>
<li>Add <code>-D 'PT_INTERP="/lib64/ld-linux-x86-64.so.2"'</code> to gcc</li>
</ul></li>
</ul></li>
<li>size<sub>t</sub> for loop/index portability</li>
<li><code>errno.h</code> and <code>perror</code> to print thread local state of <code>errno</code></li>
<li><a href="https://github.com/mpv-player/mpv/commit/1e70e82baa9193f6f027338b0fab0f5078971fbe">wchar<sub>t</sub></a>
<ul class="org-ul">
<li><code>setlocale</code> is global state across all threads
<ul class="org-ul">
<li>C locale is not UTF-8 there may be C.UTF-8 available</li>
</ul></li>
</ul></li>
<li>VLAs mandatory (again?) in C23
<ul class="org-ul">
<li>{} is valid 0 initializer to avoid memset of vla (could be 0 sized)</li>
<li>misunderstood as a 'stack' allocated array. Actual use is mainly for typing.
<ul class="org-ul">
<li>'sufficently' smart compiler can expand/probe stack with heap allocation as needed to compute sizes based on default allocation sizes for the target compiled platforms.</li>
<li>ex. <code>typedef int T[n]</code> can be stack allocated <code>T a</code> or heap allocated <code>T *a malloc(sizeof *a)</code>. Useful for matrix operations.</li>
</ul></li>
</ul></li>
<li><code>#embed</code> add in C23 for including files as arrays (previously used xxd)</li>
<li>C11 added <code>stdatomic.h</code></li>
<li>C11 added <code>theads.h</code></li>
<li>C23 N2888 allows exact width integer types to exceed <code>(u)intmax_t</code></li>
<li>C23 added <code>constexpr</code></li>
<li>C23 adds <code>nullptr</code> constant</li>
<li>C23 adds <code>auto</code> typing</li>
<li>reserved names that start with <a href="https://www.iso-9899.info/n1570.html#7.31">to, is, </a><a href="https://devblogs.microsoft.com/oldnewthing/20230109-00/?p=107685">etc</a> (externally linked names are limited to ~36chars C99)
<ul class="org-ul">
<li>in standard library</li>
<li>begin with underscore and have external linkage</li>
<li>begin with an underscore followed by a capital letter or another underscore</li>
<li>begin with is or to followed by a lowercase letter</li>
<li>begin with str or wcs followed by a lowercase letter</li>
<li>begin with <code>cr_</code></li>
<li>begin with <code>atomic_</code> or <code>memory_</code> followed by a lowercase letter</li>
<li>begin with <code>cnd_</code>, <code>mtx_</code>, <code>thrd_</code> or <code>tss_</code> followed by a lowercase letter</li>
<li>begin with int or uint and ending with <code>_t</code></li>
<li>begin with E followed by a number or uppercase letter</li>
<li>begin with <code>FE_</code> followed by an uppercase letter</li>
<li>begin with INT or UINT and ending with <code>_MAX</code>, <code>_MIN</code>, or <code>_C</code></li>
<li>begin with <code>LC_</code> or <code>FP_</code> followed by an uppercase letter</li>
<li>begin with <code>MATH_</code> followed by an uppercase letter</li>
<li>begin with SIG or <code>SIG_</code> followed by an uppercase letter</li>
<li>begin with <code>TIME_</code> or <code>ATOMIC_</code> followed by an uppercase letter</li>
<li>gnu reserves names ending with <code>_t</code>, names begginning with <code>mem</code> then lowercase letter, names prefixed with any of <code>d_ l_ F_ O_ S_ gr_ pw_ sa_ SA_ st_ tms_ c_ V I O TC</code>, Names ending with <code>_MAX</code>, B followed by a number</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-c" id="orgcc29826">// function to create signal handlers
#include &lt;signal.h&gt;
  void createSignalHandler() {
      struct sigaction SigInt; // declare signal action(s)
      memset(&amp;SigInt, 0, sizeof(SigInt)); // clear the structure for SIGINT
      SigInt.sa_handler = signalHandler; // setup SIGINT as signalHandler
      sigemptyset(&amp;SigInt.sa_mask);
      if (-1 == sigaction(SIGINT, &amp;SigInt, NULL)) { // check errors
          // Error assigning SIGINT
      }
  }
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
